## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.equalvote will be created
  + resource "azurerm_kubernetes_cluster" "equalvote" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "equalvote"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westus2"
      + name                                = "equalvote"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "equalvote"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "agentpool"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2als_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.k8s will be destroyed
  # (because azurerm_kubernetes_cluster.k8s is not in configuration)
  - resource "azurerm_kubernetes_cluster" "k8s" {
      - api_server_authorized_ip_ranges     = [] -> null
      - custom_ca_trust_certificates_base64 = [] -> null
      - dns_prefix                          = "starvoting" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "starvoting-xqaorwxo.hcp.westus2.azmk8s.io" -> null
      - id                                  = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.ContainerService/managedClusters/star-voting-cluster" -> null
      - image_cleaner_enabled               = false -> null
      - image_cleaner_interval_hours        = 48 -> null
      - kube_admin_config                   = (sensitive value) -> null
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
      - kubernetes_version                  = "1.27.7" -> null
      - local_account_disabled              = false -> null
      - location                            = "westus2" -> null
      - name                                = "star-voting-cluster" -> null
      - node_resource_group                 = "MC_equalvote_star-voting-cluster_westus2" -> null
      - node_resource_group_id              = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/MC_equalvote_star-voting-cluster_westus2" -> null
      - oidc_issuer_enabled                 = false -> null
      - portal_fqdn                         = "starvoting-xqaorwxo.portal.hcp.westus2.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "equalvote" -> null
      - role_based_access_control_enabled   = true -> null
      - run_command_enabled                 = true -> null
      - sku_tier                            = "Free" -> null
      - support_plan                        = "KubernetesOfficial" -> null
      - tags                                = {} -> null
      - workload_identity_enabled           = false -> null

      - default_node_pool {
          - custom_ca_trust_enabled      = false -> null
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 0 -> null
          - max_pods                     = 110 -> null
          - min_count                    = 0 -> null
          - name                         = "agentpool" -> null
          - node_count                   = 2 -> null
          - node_labels                  = {} -> null
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          - orchestrator_version         = "1.27.7" -> null
          - os_disk_size_gb              = 128 -> null
          - os_disk_type                 = "Managed" -> null
          - os_sku                       = "Ubuntu" -> null
          - scale_down_mode              = "Delete" -> null
          - tags                         = {} -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_B2als_v2" -> null
          - zones                        = [] -> null
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "3f090270-0647-45ed-a4f8-846976d40aee" -> null
          - tenant_id    = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9" -> null
          - type         = "SystemAssigned" -> null
        }

      - kubelet_identity {
          - client_id                 = "cce5fdb0-7af3-45ec-8192-39140fd56626" -> null
          - object_id                 = "146b4f71-8ab9-4646-9464-dcb7b5d176c9" -> null
          - user_assigned_identity_id = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/MC_equalvote_star-voting-cluster_westus2/providers/Microsoft.ManagedIdentity/userAssignedIdentities/star-voting-cluster-agentpool" -> null
        }

      - network_profile {
          - dns_service_ip    = "10.0.0.10" -> null
          - ip_versions       = [
              - "IPv4",
            ] -> null
          - load_balancer_sku = "standard" -> null
          - network_plugin    = "kubenet" -> null
          - outbound_type     = "loadBalancer" -> null
          - pod_cidr          = "10.244.0.0/16" -> null
          - pod_cidrs         = [
              - "10.244.0.0/16",
            ] -> null
          - service_cidr      = "10.0.0.0/16" -> null
          - service_cidrs     = [
              - "10.0.0.0/16",
            ] -> null

          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/MC_equalvote_star-voting-cluster_westus2/providers/Microsoft.Network/publicIPAddresses/9bfaed4c-31c6-43c6-bd58-9c70c34b72f9",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }
    }

  # azurerm_subnet.equalvote will be created
  + resource "azurerm_subnet" "equalvote" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "equalvote"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "equalvote"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "equalvote"
    }

  # azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.0.1.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/virtualNetworks/sv-vnet/subnets/sv-net" -> null
      - name                                           = "sv-net" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "equalvote" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [
          - "Microsoft.Storage",
        ] -> null
      - virtual_network_name                           = "sv-vnet" -> null
    }

  # azurerm_virtual_network.equalvote will be created
  + resource "azurerm_virtual_network" "equalvote" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "equalvote"
      + resource_group_name = "equalvote"
      + subnet              = (known after apply)
    }

  # azurerm_virtual_network.this will be destroyed
  # (because azurerm_virtual_network.this is not in configuration)
  - resource "azurerm_virtual_network" "this" {
      - address_space           = [
          - "10.0.0.0/16",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "701a054c-783a-4dc5-a63b-55f594c6aa77" -> null
      - id                      = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/virtualNetworks/sv-vnet" -> null
      - location                = "westus2" -> null
      - name                    = "sv-vnet" -> null
      - resource_group_name     = "equalvote" -> null
      - subnet                  = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/virtualNetworks/sv-vnet/subnets/sv-net"
              - name           = "sv-net"
              - security_group = ""
            },
        ] -> null
      - tags                    = {} -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```
</details>